#+TITLE: Sharp My Giraffe

Project created for practicing constructing web apps with F#'s Giraffe
library.

** Fundamental Abstractions

#+begin_src fsharp
type HttpFuncResult = Task<HttpContext option>
type HttpFunc = HttpContext -> HttpFuncResult
type HttpHandler = HttpFunc -> HttpContext -> HttpFuncResult
#+end_src

Unwraping the definitions we have:

#+begin_src fsharp
type HttpHandler = (HttpContext -> Task<HttpContext option>) -> HttpContext -> Task<HttpContext option>
#+end_src

Let's play with a minimalistic HttpContext and see what an HttpHandler
looks like.

#+begin_src fsharp :results value
  type HttpContext = {
      Headers: string list;
      Url: string;
      Path: string;
      Response: string option;
  }

  let route targetPath next ctx =
      match ctx.Path with
          | p when p = targetPath  -> next ctx
          | _ -> None

  let choose handlers ctx =
    
    

  let ctx = {
      Headers = ["content:html"]
      Url = "localhost:8080"
      Path = "/resource2"
      Response = None
  }

  ctx
  |> route "/resource" (fun ctx ->
                            printfn "%A" ctx
                            Some ({ ctx with Response = Some "[]" })
                        )
#+end_src

#+RESULTS:
#+begin_example
type HttpContext =
  {
    Headers: string list
    Url: string
    Path: string
    Response: string option
  }
val route:
  targetPath: string -> next: (HttpContext -> 'a option) -> ctx: HttpContext
    -> 'a option
val ctx: HttpContext = { Headers = ["content:html"]
                         Url = "localhost:8080"
                         Path = "/resource2"
                         Response = None }
val it: HttpContext option = None
#+end_example

